<template>
  <view class="privacyAgreement">
    <view class="header-title"> 隐私政策 </view>
    <div class="content">
      <p>根据《中华人民共和国民法典》及相关法律法规的规定，甲乙双方在平等自愿、协商一致的基础上，就乙方为甲方提供家装服务事宜，达成如下协议：</p>
      <p>一、工作内容及要求</p>
      <p>乙方同意按照甲方的家装工程需求，完成指定的工作任务，具体工作内容包括但不限于墙面粉刷、地面铺贴、水电安装、木工制作等。</p>
      <p>乙方应按照国家及地方相关家装标准、甲方要求及施工规范进行施工，确保工作质量达到 [具体质量标准，如墙面平整度误差不超过 ±[X] 毫米等]。</p>
      <p>二、工作地点</p>
      <p>工作地点为 [具体装修工程地点]，若因甲方业务需要变更工作地点，应提前通知乙方。</p>
      <p>三、工作时间和休息休假</p>
      <p>甲方根据家装工程进度安排乙方的工作时间，乙方应按照甲方要求按时出勤。</p>
      <p>乙方享有国家法定节假日、婚假、产假、丧假等带薪休假权利，具体休假安排按照国家及甲方相关规定执行。如因工程进度需要，乙方在节假日加班，甲方应按照国家规定支付加班工资。</p>
      <p>四、劳动报酬及支付方式</p>
      <p>甲方按照乙方完成的家装工作量向乙方支付劳动报酬，具体报酬标准为 [明确每单位工作量的报酬金额，如每平方米墙面粉刷 [X] 元，每米水电线路安装 [X] 元等]。</p>
      <p>甲方每月 [具体支付日期] 以货币形式支付乙方上月工资。如遇节假日或休息日，则提前至最近的工作日支付。</p>
      <p>五、社会保险和福利待遇</p>
      <p>
        若双方为劳动关系，甲方按照国家及地方有关规定为乙方缴纳 [具体社会保险种类，如养老保险、医疗保险、失业保险、工伤保险、生育保险]。若为劳务关系，双方可协商是否缴纳社会保险，如缴纳，费用承担方式
      </p>
      另行约定。
      <p>乙方享受甲方提供的 [如工作餐、住宿等具体福利待遇，如有则详细说明，没有则注明无] 福利待遇。</p>
      <p>六、劳动保护、劳动条件和职业危害防护</p>
      <p>甲方为乙方提供必要的劳动保护用品，如安全帽、工作服、手套等，并按照国家及地方相关规定对乙方进行劳动安全卫生教育，防止劳动过程中的事故，减少职业危害。</p>
      <p>乙方在工作过程中应严格遵守安全操作规程，如因乙方违反规定导致发生安全事故，乙方应承担相应责任。</p>
      <p>七、协议的解除和终止</p>
      <p>经甲乙双方协商一致，可以解除本协议。</p>
      <p>若乙方有下列情形之一的，甲方可以随时解除本协议：</p>
      <p>在试用期内被证明不符合录用条件的（如适用）。</p>
      <p>严重违反甲方规章制度的。</p>
      <p>严重失职、营私舞弊，给甲方造成重大损害的。</p>
      <p>被依法追究刑事责任的。</p>
      <p>其他甲方可随时解除协议的法定情形。</p>
      <p>有下列情形之一的，本协议终止：</p>
      <p>本协议期满的。</p>
      <p>乙方开始依法享受基本养老保险待遇的。</p>
      <p>乙方死亡，或者被人民法院宣告死亡或者宣告失踪的。</p>
      <p>甲方被依法宣告破产的。</p>
      <p>甲方被吊销营业执照、责令关闭、撤销或者甲方决定提前解散的。</p>
      <p>法律、行政法规规定的其他情形。</p>
      <p>八、违约责任</p>
      <p>若甲方未按照本协议约定按时足额支付乙方劳动报酬，每逾期一日，应按照未支付金额的 [X%] 向乙方支付违约金。</p>
      <p>若乙方未按照本协议约定的工作内容及要求完成工作任务，或者因乙方原因导致工作质量不符合标准，乙方应负责无偿返工直至达到质量要求，如给甲方造成损失的，乙方应予以赔偿。</p>
      <p>任何一方违反本协议约定的保密义务或竞业限制义务（如有），应向对方支付违约金 [具体金额]，并赔偿对方因此遭受的全部损失。</p>
      <p>九、争议解决</p>
      <p>甲乙双方在履行本协议过程中发生争议，应首先通过协商解决；协商不成的，可以向有管辖权的劳动争议仲裁委员会申请仲裁（若为劳动关系）或向人民法院提起诉讼（若为劳务关系等其他情形）。</p>
      <p>十、其他条款</p>
      <p>本协议未尽事宜，双方可另行协商并签订补充协议，补充协议与本协议具有同等法律效力。</p>
      <p>本协议一式两份，甲乙双方各执一份，自双方签字（或盖章）之日起生效。</p>
      <p>甲方（盖章）：__________</p>
      <p>法定代表人或授权代表（签字）：__________</p>
      <p>签订日期：____年__月__日</p>
      <p>乙方（签字）：__________</p>
      <p>签订日期：____年__月__日</p>
    </div>
  </view>
</template>

<script></script>
<style>
page {
  background: #f6f6f6;
}
</style>
<style scoped lang="scss">
.header-title {
  font-size: 48rpx;
  font-weight: 700;
  text-align: center;
  color: #000000;
  padding: 46rpx 0rpx;
  box-sizing: border-box;
}

.content {
  padding: 0 32rpx;
  box-sizing: border-box;
  view {
    text-indent: 60rpx;
    font-size: 30rpx;
    font-weight: normal;
    line-height: 42rpx;
    color: #000000;
  }
  padding-bottom: 100rpx;
}
</style>
